Revit 2025 API
ScheduleHorizontalAlignment Enumeration
 Horizontal alignment of data in a schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ScheduleHorizontalAlignment
Public Enumeration ScheduleHorizontalAlignment
public enum class ScheduleHorizontalAlignment
type ScheduleHorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Left aligned
Center | 1 |  Center aligned
Right | 2 |  Right aligned
See Also
Reference
Autodesk.Revit.DB Namespace